---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InsertColumnViewFailure
source: html/d6158074-fd4c-2c3a-b2e6-42b06daac4b2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InsertColumnViewFailure Property

Column cannot be placed in Elevation or Section view

## Syntax (C#)
```csharp
public static FailureDefinitionId InsertColumnViewFailure { get; }
```